u5197140705-commits/dbus_porting_BA/ozone/variant_efr32bg21/svd/EFR32BG21A010F1024IM32.svd
        <register>
          <name>CONSUMER_USART1_IR</name>
          <description>No Description</description>
          <addressOffset>0x190</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_USART1_RX</name>
          <description>No Description</description>
          <addressOffset>0x194</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_USART1_TRIGGER</name>
          <description>No Description</description>
          <addressOffset>0x198</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_USART2_CLK</name>
          <description>No Description</description>
          <addressOffset>0x19C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_USART2_IR</name>
          <description>No Description</description>
          <addressOffset>0x1A0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_USART2_RX</name>
          <description>No Description</description>
          <addressOffset>0x1A4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_USART2_TRIGGER</name>
          <description>No Description</description>
          <addressOffset>0x1A8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_WDOG0_SRC0</name>
          <description>No Description</description>
          <addressOffset>0x1AC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_WDOG0_SRC1</name>
          <description>No Description</description>
          <addressOffset>0x1B0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_WDOG1_SRC0</name>
          <description>No Description</description>
          <addressOffset>0x1B4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CONSUMER_WDOG1_SRC1</name>
          <description>No Description</description>
          <addressOffset>0x1B8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>PRSSEL</name>
              <description>Asynchronous Channel Selection </description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
