u5197140705-commits/dbus_porting_BA/ozone/variant_efr32bg21/svd/EFR32BG21A010F1024IM32.svd
        <register>
          <name>SCAN11</name>
          <description>No Description</description>
          <addressOffset>0x0CC</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>PINNEG</name>
              <description>Negative Pin Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTNEG</name>
              <description>Negative Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground (single-ended)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINNEG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINNEG</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINNEG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINNEG</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOS</name>
              <description>Positive Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTPOS</name>
              <description>Positive Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY</name>
                  <description>Supply Pin - Select specific supply using PINPOS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINPOS</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINPOS</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINPOS</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINPOS</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG</name>
              <description>Configuration Group Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFIG0</name>
                  <description>Use configuration group 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG1</name>
                  <description>Use configuration group 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAN12</name>
          <description>No Description</description>
          <addressOffset>0x0D0</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>PINNEG</name>
              <description>Negative Pin Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTNEG</name>
              <description>Negative Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground (single-ended)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINNEG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINNEG</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINNEG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINNEG</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOS</name>
              <description>Positive Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTPOS</name>
              <description>Positive Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY</name>
                  <description>Supply Pin - Select specific supply using PINPOS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINPOS</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINPOS</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINPOS</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINPOS</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG</name>
              <description>Configuration Group Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFIG0</name>
                  <description>Use configuration group 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG1</name>
                  <description>Use configuration group 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAN13</name>
          <description>No Description</description>
          <addressOffset>0x0D4</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>PINNEG</name>
              <description>Negative Pin Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTNEG</name>
              <description>Negative Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground (single-ended)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINNEG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINNEG</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINNEG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINNEG</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOS</name>
              <description>Positive Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTPOS</name>
              <description>Positive Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY</name>
                  <description>Supply Pin - Select specific supply using PINPOS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINPOS</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINPOS</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINPOS</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINPOS</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG</name>
              <description>Configuration Group Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFIG0</name>
                  <description>Use configuration group 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG1</name>
                  <description>Use configuration group 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCAN14</name>
          <description>No Description</description>
          <addressOffset>0x0D8</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0003FFFF</resetMask>
          <fields>
            <field>
              <name>PINNEG</name>
              <description>Negative Pin Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTNEG</name>
              <description>Negative Port Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground (single-ended)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINNEG</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINNEG</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINNEG</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINNEG</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PINPOS</name>
              <description>Positive Pin Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PORTPOS</name>
              <description>Positive Port Select</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GND</name>
                  <description>Ground</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SUPPLY</name>
                  <description>Supply Pin - Select specific supply using PINPOS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTA</name>
                  <description>Port A - Select pin number using PINPOS</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTB</name>
                  <description>Port B - Select pin number using PINPOS</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTC</name>
                  <description>Port C - Select pin number using PINPOS</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PORTD</name>
                  <description>Port D - Select pin number using PINPOS</description>
                  <value>11</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFG</name>
              <description>Configuration Group Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONFIG0</name>
                  <description>Use configuration group 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONFIG1</name>
                  <description>Use configuration group 1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMP</name>
              <description>Comparison Enable</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
